<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
    <style> body { font-family: "細明體""Helvetica", "Verdana", "sans-serif"; }</style>
</head>
<body>

</body>
</html>
<?php

$empRs = array('jing18');
GenPdf($empRs);
exit;

function SendMailing($fpw, $fpw2, $emp)
{
//上傳檔案
    $upLoadFile = "pdf\\" . trim($emp['Em_Code']) . '_' . $emp['Years'] . sprintf("%02d", $emp['Months']) . '.pdf';
    if (file_exists($upLoadFile)) {
//        echo iconv('big5', 'utf-8', $emp['Em_Name']) . "{$upLoadFile} ok! ";
        $msg = $emp['Em_Name'] . "{$upLoadFile} ok!<br /> " . PHP_EOL;
        fwrite($fpw2, $msg);
    } else {
//        echo iconv('big5', 'utf-8', $emp['Em_Name']) . "{$upLoadFile} 有怪獸 ! <br />";
        $msg = $emp['Em_Name'] . "{$upLoadFile} 有怪獸 ! <br />" . PHP_EOL;
        fwrite($fpw2, $msg);

        return;
    }

    $email = trim($emp['Em_Email']);
    if (strlen($email) == 0) {
        echo date("G:i:s") . "{$emp['Em_Code']} {$emp['Em_Name']} 郵寄地址不全 !<br />";

        return;
    }

    if ($emp['Flag'] == '1') {
        $subject = "大展證券股份有限公司 " . "年獎明細表";
    } else {
        $subject = "大展證券股份有限公司 " . $emp['Years'] . '/' . sprintf("%02d", $emp['Months']) . " 薪資明細表";
    }
    $contexts = "愛用國貨";

    $mail1          = new PHPMailer(); // defaults to using php "mail()"
    $mail1->CharSet = 'big5';
    $mail1->IsSMTP();
    $mail1->SMTPAuth = true; // turn on SMTP authentication
    $mail1->Username = "jingwal@mail1.tachan.com.tw";// turn on SMTP authentication
    $mail1->Password = "jing28";// turn on SMTP authentication
    $mail1->Host     = 'mail1.tachan.com.tw';

    if ($emp['Flag'] == '1') {
        $mBody = "各位同仁：新春愉快！\n\n";
        $mBody .= "年獎說明：\n";
        $mBody .= "1.年獎係依考核評等計算(優等底薪3個月、甲等2個月、乙等1個月、丙等無),不滿一年者依到職月份比例計算(15日以前到職計一個月，15日以後到職不計)。\n";
        $mBody .= "2.其它獎金係績效獎金依基數計算，並搭配考績評等增減(考績優等者基數*1.5、考績甲等者基數*1、考績乙等者基數*0.5)；其它加項為董事長另加部份。\n";
        $mBody .= "3.尚在試用期人員依公司獎金辦法不發年終獎金。\n";

        //$mBody .= "4.其他係指績效依基數計算，並搭配考績評等增減，考績優等者基數*1.5、考績甲等者基數*1、考績乙等者基數*0.5。\n";
    } else {
        //$mBody = "各位同仁：新春愉快！\n\n";
        //$mBody .= "一月份薪資於2月1日入帳。\n";
        //$mBody .= '\n本月薪資提前於2月3日發放。';

        $mBody = $subject;
    }

    $mail1->Body     = iconv('utf-8', 'big5', $mBody);
    $mail1->From     = 'tina@mail.tachan.com.tw';
    $mail1->FromName = 'tina';
    $mail1->AddReplyTo('tina@mail.tachan.com.tw', 'tina');
    $mail1->Subject = iconv('utf-8', 'big5', $subject);
    $mail1->AddAddress($email);

    $mail1->AddAttachment($upLoadFile);      // attachment

    if (!$mail1->Send()) {
//        echo date("G:i:s") . "=>" . ".發送" . $email . "失敗<br>";
        $msg    = date("G:i:s") . "=>" . ".發送" . $emp['Em_Name'] . $email . "失敗<br>" . PHP_EOL;
        $email1 = $email . chr(13) . chr(10);
        fwrite($fpw, $email1);
        fwrite($fpw2, $msg);
        $email1 = "";
    } else {
//        echo date("G:i:s") . "=>" . ".發送" . $email . "成功<br>";
        $msg = date("G:i:s") . "=>" . ".發送" . $emp['Em_Name'] . $email . "成功<br>" . PHP_EOL;
        fwrite($fpw2, $msg);
    }
}

function GenPdf($emps)
{
    //require_once('../../tcpdf/config/lang/eng.php');
    //require_once('../../tcpdf/tcpdf.php');
    

    array_map('unlink', glob("pdf\\*.pdf"));

    $mail1listfalse = "pdf\\" . date('YmdHis') . "mailfalse.txt";
    $msgFilename    = "pdf\\" . date('YmdHis') . "msg.txt";
    $fpw            = fopen($mail1listfalse, "w");
    $fpw2           = fopen($msgFilename, "w");
    $msg            = date('Y/m/d H:i:s') . " [起跑]<br /><br />" . PHP_EOL;
    fwrite($fpw2, $msg);

    $uploaddir = 'pdf'; //存放路徑
require_once('tcpdf_include.php');
	require_once('lang/eng.php');


    foreach ($emps as $emp) {
        //$pdf = new TCPDF(PDF_PAGE_ORIENTATION, PDF_UNIT, PDF_PAGE_FORMAT, true, 'UTF-8', false);
        $pdf = new TCPDF('L', PDF_UNIT, 'A3', true, 'UTF-8', false);
        $pdf->SetCreator('GoodYear');
        $pdf->SetAuthor('GoodYear');
        $pdf->SetTitle('GoodYear');
        $pdf->SetSubject('GoodYear');
        $pdf->SetKeywords('GoodYear');
        $pdf->setPrintHeader(false);
        $pdf->setHeaderFont(Array(PDF_FONT_NAME_MAIN, '', PDF_FONT_SIZE_MAIN));
        $pdf->setFooterFont(Array(PDF_FONT_NAME_DATA, '', PDF_FONT_SIZE_DATA));
        $pdf->SetDefaultMonospacedFont(PDF_FONT_MONOSPACED);
        $pdf->SetMargins(PDF_MARGIN_LEFT, PDF_MARGIN_TOP, PDF_MARGIN_RIGHT);
        $pdf->SetHeaderMargin(PDF_MARGIN_HEADER);
        $pdf->SetFooterMargin(PDF_MARGIN_FOOTER);
        $pdf->SetAutoPageBreak(TRUE, PDF_MARGIN_BOTTOM);
        $pdf->setImageScale(PDF_IMAGE_SCALE_RATIO);
        $pdf->setLanguageArray($l);
//$pdf->SetFont('arialunicid0', '', 8);
        //$pdf->SetFont('msungstdlight', '', 8);
        $pdf->SetFont('msungstdlight', '', 12);
        //$tachan_pass = trim($emp['Idno']);  // 密碼
        $tachan_pass = '';  // 密碼
        $pdf->SetProtection($permissions = array('modify', 'copy'), $user_pass = $tachan_pass, $owner_pass = null, $mode = 0, $pubkeys = null);

        $pdf->AddPage();

// 內文 ----------------------------------------

        $html = htmlText($emp);

// 內文 ----------------------------------------

        $pdf->writeHtml($html, true, 0, true, 0);

        $upLoadFile = 'test.pdf';
        $pdf->Output($uploaddir . "\\" . $upLoadFile, 'F');

        unset($pdf);

        // 郵寄
        //if ($emp['Em_EmailYN']) {
        //    //SendMailing($fpw, $fpw2, $emp);
        //    echo '郵寄';
        //}
    }

    $msg = '<br />' . date('Y/m/d H:i:s') . " [終點]" . PHP_EOL;
    fwrite($fpw2, $msg);
    fclose($fpw);
    fclose($fpw2);

    return $msgFilename;
}

function htmlText($emp)
{
    date_default_timezone_set('Asia/Taipei');
    $dateTime = date('Y/m/d H:i:s') . ' 製作';

//    $emp['Em_Name'] = iconv('big5', 'utf-8', $emp['Em_Name']);
//    $emp['depName'] = iconv('big5', 'utf-8', $emp['depName']);

    $html
        = <<<END
資料日期：107/02/09                大 展 證 券 股 份 有 限 公 司 【專戶餘額】          頁    次： 1           
          
 # 專戶帳號0130017-001030993566　：　[經紀]世華銀客戶保證金專戶                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐<br>
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │<br>
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤<br>
│152           │                          │                                                                        │           152│                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220107-107118508601　：　[經紀]中信銀自有保證金專戶                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220107-107118512309　：　[經紀]中信銀客戶保證金專戶                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│9,340,214     │991,156       3,658,556   │         14,060                                                         │    11,993,554│                  26,901          │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：3,658,556           客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220107-1071185123091　：　[經紀]中信銀客戶保證金專戶(定存)                               
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220107-1071185123092　：　[經紀]中信銀結算保證金專戶                                     
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]



 資料日期：107/02/09                大 展 證 券 股 份 有 限 公 司 【專戶餘額】          頁    次： 2           
          
 # 專戶帳號8220901-901118066608　：　[經紀]上手結算保證金專戶                                        
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│34,057,953    │                          │                     -210,015                      -147,250   -1,021,300│    32,679,388│                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 #專戶合併統計：國內台幣（TWD）                                                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│43,398,319    │991,156       3,658,556   │         14,060      -210,015                      -147,250   -1,021,300│    44,673,094│                  26,901          │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：3,658,556           客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220107-107131035025　：　[經紀]結算保證金專戶[美元]                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220901-901131012134　：　[經紀]上手結算保證金專戶[美元]                                  
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 #專戶合併統計：國內美金（USD）                                                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]



 資料日期：107/02/09                大 展 證 券 股 份 有 限 公 司 【專戶餘額】          頁    次： 3           
          
 #專戶合併統計：國內日圓（JPY）                                                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220107-1071310350252　：　[經紀]中信銀客戶保證金專戶[人民幣]                             
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 # 專戶帳號8220901-9011310121342　：　[經紀]上手結算保證金專戶[[人民幣]                              
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 #專戶合併統計：國內人民幣（CNY）                                                                    
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 #專戶合併統計：國外台幣（TWD）                                                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]



 資料日期：107/02/09                大 展 證 券 股 份 有 限 公 司 【專戶餘額】          頁    次： 4           
          
 #專戶合併統計：國外美金（USD）                                                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 #專戶合併統計：國內日圓（JPY）                                                                      
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 #專戶合併統計：國內人民幣（CNY）                                                                    
┌ㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┬ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┐
│專戶昨日餘額  │  撥出金額  /  撥入金額   │ 昨日交稅.手續費 / 權利金淨額 / 本日到期損益 / 本日成交損益 /  部位損益 │ 專戶本日餘額 │客戶明日出金 / 本日交稅.手續費    │
├ㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┼ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┤
│              │                          │                                                                        │              │                                  │
└ㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┴ㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧㄧ┘
 [  客戶本日出金    ：                     客戶本日入金    ：                    客戶明日出金    ：                    客戶明日入金    ：                   ]
 [  專戶本日出金    ：                     專戶本日入金    ：                    專戶明日出金    ：                    專戶明日入金    ：                   ]

 ================================================================================================================================================================
          ＜＜ 報表到此列印完畢＞＞      列印參考時間:107/02/12 11:56:33   列印人員:970003
                     總經理：                    經  理：                    覆  核：                    製  表：

END;

    return $html;
}

?>

<!--<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">-->
<!---->
<!--<html>-->
<!--    <head>-->
<!--        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">-->
<!--        <title>郵遞薪資表</title>-->
<!--    </head>-->
<!--    <body>-->
<!--        --><?php
//		if (!file_exists('topdf.php'))
//		{
//			echo '請先在 tachan.mdb 執行 [薪資郵寄作業], 謝謝!';
//			exit;
//		}
//
//        set_time_limit(0);
//        date_default_timezone_set('Asia/Taipei');
//        echo date('Y/m/d H:i:s') . " [起跑]<br /><br />";
//
//		$emps = array();
//
//        require_once 'topdf.php';
//        require_once '../../phpmailer/class.phpmailer.php';
//
//        // 產生 pdf
//        GenPdf($emps);
//
//        echo "<br>發送完成..可以關閉網頁了<br>";
//
//        echo '<br />' . date('Y/m/d H:i:s') . " [終點]";
//        set_time_limit(30);
//		unlink('topdf.php');
//
?>
<!--    </body>-->
<!--</html>-->
